// ================================
console.log("           Task 1:");
// ================================
// 1. Поясни різницю між параметром і аргументом функції.

// параметр це ім'я змінної, яке дозволяє функції звертатись до 
// значення отриманого під час виклику
// А аргумент використовується при виклику функції, та вказує функції, яке саме 
// конкретне значення функція повинна обробити при виклику
 


// ================================
console.log("           Task 2:");
// ================================
// 2. Що поверне функція з return без значення або без return взагалі?

// функція без return поверне undefined,
// а функція без значення return просто перерве виконання функції та поверне undefined
// але якщо біля return є прописана якась дія, то вона виконається
// наприклад в одному рядку разом: return console.log("щось...написано")
// console.log в такому варіанті спрацює



// ================================
console.log("           Task 3:");
// ================================
// 3. Напиши функцію average(a, b), яка повертає середнє арифметичне двох чисел, і 
// виведи результат у консоль.

function average (a, b) {

    const sum = a + b
    return sum / 2
};
console.log(average(3, 5));



// ================================
console.log("           Task 4:");
// ================================
// 4. Напиши функцію getRectangleArea(width, height) з параметрами за замовчуванням
//  (width = 1, height = 1).

function getRectangleArea (width = 1, height = 1) {
    return width * height
};

console.log(getRectangleArea());



// ================================
console.log("           Task 5:");
// ================================
// 5. Напиши функцію isAdult(age), яка повертає true, якщо вік від 18 до 65 включно.


// ================================
console.log("   solution 1:");
// ================================
function isAdult (age) {
    if (age >= 18 && age <= 65) {
        return true;
    } else {
        return false;
    }
};
console.log(isAdult(66));


// ================================
console.log("   solution 2:");
// ================================
function isAdult2 (age) {
    return age >= 18 && age <= 65
}

console.log(isAdult(66));



// ================================
console.log("           Task 5:");
// ================================
// 6. Напиши функцію getDayPart(hour), яка повертає 'Ніч'/'Ранок'/'День'/'Вечір'. 
// Виклич її для кількох значень і виведи в консоль.

function getDayPart (hour) {
    if (hour >= 0 && hour < 6) {
        return "Ніч";
    } else if (hour >= 6 && hour < 12) {
        return "Ранок";
    } else if (hour >= 12 && hour < 18) {
        return "День";
    } else if (hour >= 18 && hour <= 23) {
        return "Вечір"
    } else {
        return "Не година дня";
    }
};

console.log(getDayPart(3))