// 1. Перепиши вираз 'Привіт, ' + name + '!' через шаблонні рядки.

let name = "Marta";
console.log(`Hello ${name}!`)

//=================================
// 2. Створи змінні firstName і lastName та виведи в консоль рядок 
// 'Повне ім'я: ...' через ${}.

let firstName = "Valentyna";
let lastName = "Tymchenko";

console.log(`Full name: ${firstName} ${lastName}`);

//=================================
// 3. Маючи ціну price і кількість qty, виведи рядок 'Сума: ${price * qty} грн' з 
// обчисленням усередині ${}.

let price = 10;
let qty = 2;

console.log(`Сума: ${price * qty} грн`);

//=================================
// 4. Створи багаторядковий рядок (наприклад, адресу з кількох рядків), використовуючи 
// зворотні лапки.

let homeAdress = `місто: Львів;
вулиця: Трускавецька;
будинок: 32;
квартира: 5;
індекс: 380-643;`

console.log(homeAdress);