// 1. Перепиши вираз 'Привіт, ' + name + '!' через шаблонні рядки.
const name = "Марта";
console.log(`Привіт, ${name}!`)

//=================================
// 2. Створи змінні firstName і lastName та виведи в консоль рядок 
// 'Повне ім'я: ...' через ${}.

const firstName = "Валентина";
const lastName = "Тумченко";

console.log(`Повне ім'я: ${firstName} ${lastName}`);

//=================================
// 3. Маючи ціну price і кількість qty, виведи рядок 'Сума: ${price * qty} грн' з 
// обчисленням усередині ${}.

const price = 10;
const qty = 2;

console.log(`Сума: ${price * qty} грн`);

//=================================
// 4. Створи багаторядковий рядок (наприклад, адресу з кількох рядків), використовуючи 
// зворотні лапки.

const homeAddress = `місто: Львів;
вулиця: Трускавецька;
будинок: 32;
квартира: 5;
індекс: 380-643;`

console.log(homeAddress);