// ===========================================
console.log("       Task 1:");
// ===========================================
// 1. Перепиши звичайну функцію суми двох чисел у вигляді стрілкової.

const sum = (a, b) => a + b;
console.log(sum(2, 3));



// ===========================================
console.log("       Task 2:");
// ===========================================
// 2. Який запис стрілкової функції дозволяє не писати return? Наведи приклад.

// Коли тіло функції містить один вираз

const howMuchHour = (minut) => minut / 60;
console.log(howMuchHour(60));



// ===========================================
console.log("       Task 3:");
// ===========================================
// 3. Напиши функцію applyOperation(a, b, operation), яка викликає передану функцію 
// operation з аргументами a і b. Передай їй стрілкову функцію множення і виведи 
// результат у консоль.

const applyOperation = (a, b, operation) => {
    return operation(a, b);
}

console.log(applyOperation(2, 2, (a, b) => a * b))



// ===========================================
console.log("       Task 4:");
// ===========================================
// 4. Напиши стрілкову функцію greet(name), яка повертає рядок 'Привіт, <ім'я>!' 
// через шаблонний рядок, і виведи результат у консоль

const greet = (name) => `Привіт, ${name}!`;
console.log(greet("Марія"));