console.log("       Task 1:");
// ==============================
// 1. Виведи в консоль рядок 'Hello!' 10 разів за допомогою циклу for.

for (let i = 0; i < 10; i++){
    console.log("Hello!")
};



// ==============================
console.log("       Task 2:");
// ==============================
// 2. Виведи в консоль числа від 10 до 1 у зворотному порядку (for).

for (let i = 10; i > 0; i--) {
    console.log(i)
};



// ==============================
console.log("       Task 3:");
// ==============================
// 3. Порахуй і виведи в консоль суму парних чисел у діапазоні від 1 до 20 (for).

let sum = 0;
for (let i = 1; i <= 20; i++){
    if (i % 2 === 0) {
        sum += i;
    }}
console.log(sum);



// ==============================
console.log("       Task 4:");
// ==============================
// 4. Виведи в консоль таблицю множення для числа 5 (for).
for (let i = 1; i <= 10; i++) {
        console.log(`${i} x 5 = ${i * 5}`);
} 



// ==============================
console.log("       Task 5:");
// ==============================
// 5. Використовуючи while, виводь число і зменшуй його на 1, поки воно більше за 0.

let i = 10;

while ( i > 0) {
    console.log(i);
    i--;
};



// ==============================
console.log("       Task 6:");
// ==============================
// 6. Поясни різницю між while і do...while та наведи приклад кожного.


// while - перевіряє умову перед виконанням тіла
// do while - виконує тіло циклу, а потім перевіряє умову\


// ==============================
console.log("           while:")
// ==============================


let count1 = 5;
while (count1 < 5) {
    console.log(count1);
    count1++;
}


// ==============================
console.log("           do ... while:");
// ==============================


let count2 = 5;; 
do {
count2++;
console.log(count2)} 
while (count2 < 5);